Autodesk.Revit.DB.MaterialSet
An set that contains materials.

Autodesk.Revit.DB.MaterialSet.Insert(Autodesk.Revit.DB.Material)
System.Int32
Insert the specified material into the set.
item: The material to be inserted into the set.
Returns: Returns whether the material was inserted into the set.

Autodesk.Revit.DB.MaterialSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.MaterialSet.ReverseIterator
Autodesk.Revit.DB.MaterialSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.MaterialSet.ForwardIterator
Autodesk.Revit.DB.MaterialSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.MaterialSet.Erase(Autodesk.Revit.DB.Material)
System.Int32
Removes a specified material from the set.
item: The material to be erased.
Returns: The number of materials that were erased from the set.

Autodesk.Revit.DB.MaterialSet.Contains(Autodesk.Revit.DB.Material)
System.Boolean
Tests for the existence of a material within the set.
item: The material to be searched for.
Returns: The Contains method returns True if the material is within the set, otherwise False.

Autodesk.Revit.DB.MaterialSet.Clear
void
Removes every material from the set, rendering it empty.

Autodesk.Revit.DB.MaterialSet.Size
System.Int32
get
Returns the number of materials that are in the set.

Autodesk.Revit.DB.MaterialSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.